package KI304.Bazarnik.lab3;

/**
 * Інтерфейс {@code Athletic} представляє базову поведінку спортсмена.
 * Він містить методи для тренувань, змагань, а також для отримання інформації
 * про вид спорту та кількість медалей.
 */
interface Athletic {

    /**
     * Тренує спортсмена.
     * Викликається для початку тренування спортсмена.
     */
    void train();

    /**
     * Спортсмен бере участь у змаганнях.
     * Викликається, коли спортсмен бере участь у змагальному заході.
     */
    void compete();

    /**
     * Повертає тип спорту спортсмена.
     *
     * @return тип спорту, яким займається спортсмен.
     */
    String getSportType();

    /**
     * Повертає кількість медалей спортсмена.
     *
     * @return кількість медалей, які отримав спортсмен.
     */
    int getMedalsCount();
}
